Repository: jiroikedafeingold/StarBattle
Catalog: StarBattle/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans

source: 🎉 Solved! 🎉
de: 🎉 Gelöst! 🎉
es: 🎉 ¡Resuelto! 🎉
fr: 🎉 Résolu ! 🎉
it: 🎉 Risolto! 🎉
ja: 🎉 クリア！🎉
ko: 🎉 해결! 🎉
pt_br: 🎉 Resolvido! 🎉
ru: 🎉 Решено! 🎉
zh_hans: 🎉 完成！🎉

source: 1 %@ per row, column and region
de: 1 %@ pro Zeile, Spalte und Region
es: 1 %@ por fila, columna y región
fr: 1 %@ par ligne, colonne et région
it: 1 %@ per riga, colonna e regione
ja: 各行・各列・各エリアに%@を1つ
ko: 행, 열, 영역마다 %@ 한 개
pt_br: 1 %@ por linha, coluna e região
ru: 1 %@ в строке, столбце и области
zh_hans: 每行、每列、每个区域 1 个%@

source: 2 %@ per row, column and region
de: 2 %@ pro Zeile, Spalte und Region
es: 2 %@ por fila, columna y región
fr: 2 %@ par ligne, colonne et région
it: 2 %@ per riga, colonna e regione
ja: 各行・各列・各エリアに%@を2つ
ko: 행, 열, 영역마다 %@ 두 개
pt_br: 2 %@ por linha, coluna e região
ru: 2 %@ в строке, столбце и области
zh_hans: 每行、每列、每个区域 2 个%@

source: A bite-size logic puzzle. Fill the board with %@ using pure deduction — no luck required.
de: Ein kompaktes Logikrätsel. Fülle das Brett mit %@ durch reine Logik – ganz ohne Glück.
es: Un rompecabezas de lógica breve. Llena el tablero de %@ con pura deducción, sin suerte.
fr: Un petit casse-tête de logique. Remplis le plateau de %@ par pure déduction, sans hasard.
it: Un puzzle di logica veloce. Riempi la griglia di %@ con pura deduzione, senza fortuna.
ja: 手軽な論理パズル。運に頼らず、純粋な推理だけで盤面を%@で埋めましょう。
ko: 간단한 논리 퍼즐. 운에 기대지 않고 순수한 추리로 보드를 %@(으)로 채우세요.
pt_br: Um quebra-cabeça de lógica rápido. Preencha o tabuleiro com %@ usando pura dedução, sem sorte.
ru: Компактная логическая головоломка. Заполните поле %@ чистой логикой — без везения.
zh_hans: 一款小巧的逻辑谜题。用纯粹的推理把棋盘填满%@，无需运气。

source: Appearance
de: Darstellung
es: Apariencia
fr: Apparence
it: Aspetto
ja: 外観
ko: 화면 모드
pt_br: Aparência
ru: Оформление
zh_hans: 外观

source: Ask for a hint
de: Um einen Tipp bitten
es: Pide una pista
fr: Demander un indice
it: Chiedi un aiuto
ja: ヒントを使う
ko: 힌트 요청하기
pt_br: Peça uma dica
ru: Попросите подсказку
zh_hans: 请求提示

source: Assists
de: Hilfen
es: Asistencias
fr: Aides
it: Aiuti
ja: アシスト
ko: 도우미
pt_br: Assistências
ru: Помощник
zh_hans: 辅助功能

source: Attempt %lld
de: Versuch %lld
es: Intento %lld
fr: Tentative %lld
it: Tentativo %lld
ja: %lld 回目
ko: %lld번째 시도
pt_br: Tentativa %lld
ru: Попытка %lld
zh_hans: 第 %lld 次尝试

source: Average time
de: Durchschnittszeit
es: Tiempo medio
fr: Temps moyen
it: Tempo medio
ja: 平均タイム
ko: 평균 시간
pt_br: Tempo médio
ru: Среднее время
zh_hans: 平均用时

source: Best time
de: Bestzeit
es: Mejor tiempo
fr: Meilleur temps
it: Tempo migliore
ja: ベストタイム
ko: 최고 기록
pt_br: Melhor tempo
ru: Лучшее время
zh_hans: 最佳用时

source: Blocks neighbours
de: Blockiert Nachbarn
es: Bloquea a los vecinos
fr: Bloque les voisins
it: Blocca i vicini
ja: 隣接マスを禁止
ko: 이웃 칸 차단
pt_br: Bloqueia os vizinhos
ru: Блокирует соседей
zh_hans: 封锁相邻格

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

source: Check
de: Prüfen
es: Revisar
fr: Vérifier
it: Verifica
ja: チェック
ko: 확인
pt_br: Verificar
ru: Проверить
zh_hans: 检查

source: Check for mistakes
de: Auf Fehler prüfen
es: Buscar errores
fr: Vérifier les erreurs
it: Cerca errori
ja: 間違いをチェック
ko: 실수 확인
pt_br: Verificar erros
ru: Проверка ошибок
zh_hans: 检查错误

source: Check your work
de: Überprüfe deine Arbeit
es: Revisa tu trabajo
fr: Vérifie ton travail
it: Controlla il tuo lavoro
ja: 答え合わせ
ko: 내 풀이 확인하기
pt_br: Confira seu trabalho
ru: Проверьте решение
zh_hans: 检查你的解答

source: Checking for one solution…
de: Eindeutige Lösung prüfen…
es: Comprobando que haya una única solución…
fr: Vérification d’une solution unique…
it: Verifica della soluzione unica…
ja: 唯一の解を確認中…
ko: 유일한 해 확인 중…
pt_br: Verificando se há uma única solução…
ru: Проверяем единственность решения…
zh_hans: 正在检查唯一解…

source: Cherry Battle is a cherry-themed take on **Star Battle**, the classic logic puzzle invented by **Hans Eendebak**. All credit for the original puzzle design goes to him.
de: Cherry Battle ist eine kirschige Variante von **Star Battle**, dem klassischen Logikrätsel von **Hans Eendebak**. Das gesamte Verdienst für das ursprüngliche Rätseldesign gebührt ihm.
es: Cherry Battle es una versión con temática de cerezas de **Star Battle**, el clásico rompecabezas de lógica creado por **Hans Eendebak**. Todo el mérito del diseño original es suyo.
fr: Cherry Battle est une variante sur le thème des cerises de **Star Battle**, le casse-tête de logique classique inventé par **Hans Eendebak**. Tout le mérite de la conception originale lui revient.
it: Cherry Battle è una versione a tema ciliegie di **Star Battle**, il classico puzzle di logica inventato da **Hans Eendebak**. Tutto il merito del design originale va a lui.
ja: Cherry Battle は、**Hans Eendebak** が考案した定番の論理パズル **Star Battle** をさくらんぼ風にアレンジしたものです。オリジナルのパズル設計の功績はすべて彼にあります。
ko: Cherry Battle은 **Hans Eendebak**이 고안한 고전 논리 퍼즐 **Star Battle**을 체리 테마로 재해석한 게임입니다. 원작 퍼즐 디자인의 모든 공로는 그에게 있습니다.
pt_br: Cherry Battle é uma versão com tema de cerejas do **Star Battle**, o clássico quebra-cabeça de lógica criado por **Hans Eendebak**. Todo o crédito do design original é dele.
ru: Cherry Battle — это «вишнёвая» версия **Star Battle**, классической логической головоломки, придуманной **Hans Eendebak**. Все заслуги за оригинальный дизайн принадлежат ему.
zh_hans: Cherry Battle 是经典逻辑谜题 **Star Battle** 的樱桃主题版本，原作由 **Hans Eendebak** 发明。原始谜题设计的全部功劳归他所有。

source: Clear
de: Leeren
es: Borrar
fr: Effacer
it: Svuota
ja: クリア
ko: 지우기
pt_br: Limpar
ru: Очистить
zh_hans: 清空

source: Clear the board?
de: Brett leeren?
es: ¿Vaciar el tablero?
fr: Vider la grille ?
it: Svuotare la griglia?
ja: 盤面をクリアしますか？
ko: 보드를 지울까요?
pt_br: Limpar o tabuleiro?
ru: Очистить поле?
zh_hans: 清空棋盘？

source: Count the gaps
de: Zähle die Lücken
es: Cuenta los huecos
fr: Compte les cases libres
it: Conta gli spazi
ja: 空きマスを数える
ko: 빈칸을 세기
pt_br: Conte os espaços
ru: Считайте пустые клетки
zh_hans: 数一数空格

source: Creating a new board…
de: Neues Brett wird erstellt…
es: Creando un tablero nuevo…
fr: Création d’une nouvelle grille…
it: Creazione di una nuova griglia…
ja: 新しいパズルを作成中…
ko: 새 퍼즐을 만드는 중…
pt_br: Criando um novo tabuleiro…
ru: Создание нового поля…
zh_hans: 正在创建新棋盘…

source: Credits
de: Danksagungen
es: Créditos
fr: Crédits
it: Crediti
ja: クレジット
ko: 크레딧
pt_br: Créditos
ru: Авторы
zh_hans: 鸣谢

source: Deep-check your dots
de: Überprüfe deine Punkte genau
es: Revisa bien tus puntos
fr: Vérifie bien tes points
it: Controlla a fondo i tuoi punti
ja: 点を入念にチェック
ko: 점을 꼼꼼히 확인하기
pt_br: Confira bem seus pontos
ru: Тщательно проверьте точки
zh_hans: 仔细检查你的点

source: Difficulty
de: Schwierigkeit
es: Dificultad
fr: Difficulté
it: Difficoltà
ja: 難易度
ko: 난이도
pt_br: Dificuldade
ru: Сложность
zh_hans: 难度

source: Do it
de: Anwenden
es: Aplicar
fr: Valider
it: Applica
ja: 確定
ko: 적용
pt_br: Aplicar
ru: Применить
zh_hans: 确定

source: Don’t like %@? Head to Settings and swap the board piece for something fun — a unicorn 🦄, a robot 🤖, even a 💩. Pick whatever makes you smile.
de: Keine Lust auf %@? Geh zu den Einstellungen und tausch die Spielfigur gegen etwas Lustiges – ein Einhorn 🦄, einen Roboter 🤖 oder sogar ein 💩. Nimm, was dich zum Lächeln bringt.
es: ¿No te gustan los %@? Ve a Ajustes y cambia la ficha por algo divertido: un unicornio 🦄, un robot 🤖 o hasta un 💩. Elige lo que te haga sonreír.
fr: Pas fan des %@ ? Va dans Réglages et remplace le pion par quelque chose d'amusant — une licorne 🦄, un robot 🤖, ou même un 💩. Choisis ce qui te fait sourire.
it: Non ti piacciono le %@? Vai in Impostazioni e cambia la pedina con qualcosa di divertente: un unicorno 🦄, un robot 🤖 o persino una 💩. Scegli ciò che ti fa sorridere.
ja: %@がお好みでない？「設定」を開いて、盤面のコマをもっと楽しいものに変えましょう——ユニコーン🦄、ロボット🤖、さらには💩まで。お好きなものをどうぞ。
ko: %@이(가) 마음에 안 드나요? 「설정」에서 보드 말을 재미있는 것으로 바꿔 보세요 — 유니콘 🦄, 로봇 🤖, 심지어 💩까지. 마음에 드는 것으로 고르세요.
pt_br: Não curte %@? Vá em Ajustes e troque a peça por algo divertido — um unicórnio 🦄, um robô 🤖 ou até um 💩. Escolha o que te fizer sorrir.
ru: Не нравятся %@? Откройте «Настройки» и замените фишку на что-нибудь весёлое — единорога 🦄, робота 🤖 или даже 💩. Выбирайте то, что вам по душе.
zh_hans: 不喜欢%@？前往「设置」，把棋子换成有趣的图案——独角兽 🦄、机器人 🤖，甚至是 💩。挑一个让你会心一笑的吧。

source: Drag across a row or column to lay a line of dots quickly.
de: Zieh über eine Zeile oder Spalte, um schnell eine Reihe Punkte zu setzen.
es: Arrastra por una fila o columna para poner una línea de puntos rápidamente.
fr: Glisse le long d'une ligne ou d'une colonne pour poser rapidement une rangée de points.
it: Trascina lungo una riga o colonna per tracciare velocemente una linea di punti.
ja: 行や列をなぞると、点をまとめてすばやく置けます。
ko: 행이나 열을 따라 드래그하면 점을 한 줄로 빠르게 찍을 수 있습니다.
pt_br: Arraste por uma linha ou coluna para colocar uma fileira de pontos rapidamente.
ru: Проведите по строке или столбцу, чтобы быстро расставить ряд точек.
zh_hans: 沿一行或一列拖动，即可快速画出一排点。

source: Drawing the coloured regions…
de: Farbige Regionen werden gezeichnet …
es: Dibujando las regiones de color…
fr: Dessin des régions colorées…
it: Disegno delle regioni colorate…
ja: 色付きエリアを描いています…
ko: 색칠된 영역을 그리는 중…
pt_br: Desenhando as regiões coloridas…
ru: Рисуем цветные области…
zh_hans: 正在绘制彩色区域…

source: Easy
de: Leicht
es: Fácil
fr: Facile
it: Facile
ja: やさしい
ko: 쉬움
pt_br: Fácil
ru: Лёгкий
zh_hans: 简单

source: Erase
de: Löschen
es: Borrar
fr: Effacer
it: Cancella
ja: 消去
ko: 지우기
pt_br: Apagar
ru: Стереть
zh_hans: 擦除

source: Erase all guesses?
de: Alle Vermutungen löschen?
es: ¿Borrar todas las suposiciones?
fr: Effacer toutes les suppositions ?
it: Cancellare tutte le ipotesi?
ja: すべての予想を消去しますか？
ko: 모든 추측을 지울까요?
pt_br: Apagar todos os palpites?
ru: Стереть все предположения?
zh_hans: 清除所有猜测？

source: Every row, column and coloured region holds exactly one %@.
de: Jede Zeile, Spalte und farbige Region enthält genau eine %@.
es: Cada fila, columna y región de color contiene exactamente una %@.
fr: Chaque ligne, colonne et région colorée contient exactement un %@.
it: Ogni riga, colonna e regione colorata contiene esattamente una %@.
ja: すべての行・列・色付きエリアに、ちょうど1つの%@が入ります。
ko: 모든 행, 열, 색칠된 영역에는 정확히 하나의 %@이(가) 들어갑니다.
pt_br: Cada linha, coluna e região colorida contém exatamente um %@.
ru: В каждой строке, столбце и цветной области ровно одна %@.
zh_hans: 每一行、每一列和每个彩色区域都恰好有一个%@。

source: Every row, column and coloured region holds exactly two %@.
de: Jede Zeile, Spalte und farbige Region enthält genau zwei %@.
es: Cada fila, columna y región de color contiene exactamente dos %@.
fr: Chaque ligne, colonne et région colorée contient exactement deux %@.
it: Ogni riga, colonna e regione colorata contiene esattamente due %@.
ja: すべての行・列・色付きエリアに、ちょうど2つの%@が入ります。
ko: 모든 행, 열, 색칠된 영역에는 정확히 두 개의 %@이(가) 들어갑니다.
pt_br: Cada linha, coluna e região colorida contém exatamente dois %@.
ru: В каждой строке, столбце и цветной области ровно две %@.
zh_hans: 每一行、每一列和每个彩色区域都恰好有两个%@。

source: Every row, column and region holds exactly two %1$@ — or just one %2$@ in Beginner mode.
de: Jede Zeile, Spalte und Region enthält genau zwei %@ – oder im Anfänger-Modus nur eine %@.
es: Cada fila, columna y región contiene exactamente dos %@; o solo una %@ en el modo Principiante.
fr: Chaque ligne, colonne et région contient exactement deux %@ — ou seulement un %@ en mode Débutant.
it: Ogni riga, colonna e regione contiene esattamente due %@, o solo una %@ in modalità Principiante.
ja: すべての行・列・エリアに、ちょうど2つの%@——ビギナーモードでは1つだけの%@が入ります。
ko: 모든 행, 열, 영역에 정확히 두 개의 %@ — 초보 모드에서는 단 하나의 %@이(가) 들어갑니다.
pt_br: Cada linha, coluna e região contém exatamente dois %@ — ou apenas um %@ no modo Iniciante.
ru: В каждой строке, столбце и области ровно две %@ — или всего одна %@ в режиме новичка.
zh_hans: 每一行、每一列和每个区域恰好有两个%@——在新手模式下则只有一个%@。

source: Every row, every column, and every coloured region holds exactly one %@.
de: Jede Zeile, jede Spalte und jede farbige Region enthält genau eine %@.
es: Cada fila, cada columna y cada región de color contiene exactamente una %@.
fr: Chaque ligne, chaque colonne et chaque région colorée contient exactement un %@.
it: Ogni riga, ogni colonna e ogni regione colorata contiene esattamente una %@.
ja: どの行も、どの列も、どの色付きエリアにも、ちょうど1つの%@が入ります。
ko: 모든 행, 모든 열, 모든 색칠된 영역에는 정확히 하나의 %@이(가) 들어갑니다.
pt_br: Cada linha, cada coluna e cada região colorida contém exatamente um %@.
ru: В каждой строке, каждом столбце и каждой цветной области ровно одна %@.
zh_hans: 每一行、每一列以及每一个彩色区域都恰好有一个%@。

source: Every row, every column, and every coloured region holds exactly two %@.
de: Jede Zeile, jede Spalte und jede farbige Region enthält genau zwei %@.
es: Cada fila, cada columna y cada región de color contiene exactamente dos %@.
fr: Chaque ligne, chaque colonne et chaque région colorée contient exactement deux %@.
it: Ogni riga, ogni colonna e ogni regione colorata contiene esattamente due %@.
ja: どの行も、どの列も、どの色付きエリアにも、ちょうど2つの%@が入ります。
ko: 모든 행, 모든 열, 모든 색칠된 영역에는 정확히 두 개의 %@이(가) 들어갑니다.
pt_br: Cada linha, cada coluna e cada região colorida contém exatamente dois %@.
ru: В каждой строке, каждом столбце и каждой цветной области ровно две %@.
zh_hans: 每一行、每一列以及每一个彩色区域都恰好有两个%@。

source: Exit Mark Mode
de: Notiz-Modus verlassen
es: Salir del modo Notas
fr: Quitter le mode Notes
it: Esci dalla modalità Note
ja: メモモードを終了
ko: 메모 모드 종료
pt_br: Sair do modo Notas
ru: Выйти из режима заметок
zh_hans: 退出记号模式

source: Feedback
de: Rückmeldung
es: Respuesta
fr: Retour
ja: フィードバック
ko: 피드백
pt_br: Resposta
ru: Отклик
zh_hans: 反馈

source: Game piece
de: Spielfigur
es: Ficha
fr: Pièce de jeu
it: Pezzo di gioco
ja: ゲームのコマ
ko: 게임 말
pt_br: Peça do jogo
ru: Игровая фишка
zh_hans: 游戏棋子

source: Games solved
de: Gelöste Spiele
es: Partidas resueltas
fr: Grilles résolues
it: Partite risolte
ja: クリア数
ko: 해결한 게임
pt_br: Jogos resolvidos
ru: Решено игр
zh_hans: 已解决

source: Games started
de: Begonnene Spiele
es: Partidas iniciadas
fr: Grilles commencées
it: Partite iniziate
ja: プレイ数
ko: 시작한 게임
pt_br: Jogos iniciados
ru: Начато игр
zh_hans: 已开始

source: Getting ready…
de: Wird vorbereitet…
es: Preparando…
fr: Préparation…
it: Preparazione…
ja: 準備中…
ko: 준비 중…
pt_br: Preparando…
ru: Подготовка…
zh_hans: 正在准备…

source: Guess %1$@ %2$@ in the square you’re unsure about, then follow the consequences — pencil in the dots and %3$@ it forces. If everything holds together, tap **Do it** to make the guesses real.
de: Vermute eine %2$@ in dem Feld, bei dem du unsicher bist, und verfolge dann die Folgen – trage die Punkte und %3$@ ein, die sie erzwingt. Wenn alles zusammenpasst, tippe auf „Anwenden“, um die Vermutungen umzusetzen.
es: Supón una %2$@ en la casilla de la que no estés seguro y sigue las consecuencias: apunta a lápiz los puntos y las %3$@ que obliga. Si todo encaja, toca «Aplicar» para hacer reales las suposiciones.
fr: Suppose un %2$@ dans la case dont tu n’es pas sûr, puis suis les conséquences — inscris au crayon les points et les %3$@ qu’il impose. Si tout tient, touche « Valider » pour rendre les suppositions réelles.
it: Ipotizza una %2$@ nella casella di cui non sei sicuro, poi segui le conseguenze: matita alla mano, segna i punti e le %3$@ che impone. Se regge tutto, tocca «Applica» per rendere reali le ipotesi.
ja: 自信のないマスに%2$@を仮定し、そのうえで結果を追いましょう——それが強いる点や%3$@を下書きしていきます。すべて矛盾なくつながったら、「確定」をタップして仮置きを本物にします。
ko: 확신이 서지 않는 칸에 %2$@을(를) 가정하고 결과를 따라가 보세요 — 그것이 강제하는 점과 %3$@을(를) 연필로 적어 나갑니다. 모두 맞아떨어지면 「적용」을 눌러 추측을 실제로 만드세요.
pt_br: Suponha um %2$@ no quadrado sobre o qual você está em dúvida e siga as consequências — marque a lápis os pontos e os %3$@ que ele exige. Se tudo se mantém, toque em «Aplicar» para tornar os palpites reais.
ru: Предположите %2$@ в клетке, в которой не уверены, затем проследите за последствиями — карандашом расставьте точки и %3$@, которых оно требует. Если всё сходится, нажмите «Применить», чтобы зафиксировать предположения.
zh_hans: 在你拿不准的格子里假设一个%2$@，然后顺着推下去——把它所迫使的点和%3$@都用铅笔记下。如果一切都成立，点按「确定」让这些假设成真。

source: Haptics
de: Haptik
es: Vibración
fr: Vibrations
it: Vibrazione
ja: 触覚フィードバック
ko: 햅틱
pt_br: Vibração
ru: Тактильный отклик
zh_hans: 触感反馈

source: Hard
de: Schwer
es: Difícil
fr: Difficile
it: Difficile
ja: むずかしい
ko: 어려움
pt_br: Difícil
ru: Сложный
zh_hans: 困难

source: Help
de: Hilfe
es: Ayuda
fr: Aide
it: Aiuto
ja: ヘルプ
ko: 도움말
pt_br: Ajuda
ru: Помощь
zh_hans: 帮助

source: Helpers
de: Hilfen
es: Ayudas
fr: Aides
it: Aiuti
ja: 補助機能
ko: 도우미
pt_br: Ajudas
ru: Помощники
zh_hans: 辅助功能

source: Helpers when you need them
de: Hilfen, wenn du sie brauchst
es: Ayudas cuando las necesites
fr: De l'aide quand il en faut
it: Aiuti quando servono
ja: 困ったときの助っ人
ko: 필요할 때 도움받기
pt_br: Ajuda quando você precisa
ru: Помощь, когда она нужна
zh_hans: 需要时的小帮手

source: Hide the timer
de: Timer ausblenden
es: Ocultar el temporizador
fr: Masquer le chronomètre
it: Nascondi il timer
ja: タイマーを隠す
ko: 타이머 숨기기
pt_br: Ocultar o cronômetro
ru: Скрыть таймер
zh_hans: 隐藏计时器

source: Hint
de: Tipp
es: Pista
fr: Indice
it: Aiuto
ja: ヒント
ko: 힌트
pt_br: Dica
ru: Подсказка
zh_hans: 提示

source: Hint places the next square that logic forces and explains why — a good way to learn a new tactic.
de: Tipp setzt das nächste logisch erzwungene Feld und erklärt warum – ideal, um eine neue Taktik zu lernen.
es: Pista coloca la siguiente casilla que la lógica obliga y explica por qué: una buena forma de aprender una nueva táctica.
fr: Indice place la prochaine case imposée par la logique et explique pourquoi — un bon moyen d'apprendre une nouvelle tactique.
it: Aiuto inserisce la prossima casella imposta dalla logica e spiega perché: un buon modo per imparare una nuova tattica.
ja: 「ヒント」は論理的に確定する次のマスを置き、その理由も説明します。新しい解き方を学ぶのに最適です。
ko: 「힌트」는 논리적으로 확정되는 다음 칸을 놓고 그 이유를 설명합니다 — 새로운 전략을 배우기에 좋습니다.
pt_br: Dica coloca o próximo quadrado que a lógica exige e explica o porquê — uma boa forma de aprender uma nova tática.
ru: Подсказка ставит следующую клетку, которую диктует логика, и объясняет почему — отличный способ освоить новый приём.
zh_hans: 「提示」会放下逻辑上必然的下一格并解释原因——这是学习新技巧的好方法。

source: Hints used
de: Verwendete Tipps
es: Pistas usadas
fr: Indices utilisés
it: Aiuti usati
ja: 使ったヒント
ko: 사용한 힌트
pt_br: Dicas usadas
ru: Использовано подсказок
zh_hans: 已用提示

source: How to play
de: Spielanleitung
es: Cómo jugar
fr: Comment jouer
it: Come si gioca
ja: 遊び方
ko: 플레이 방법
pt_br: Como jogar
ru: Как играть
zh_hans: 玩法

source: How to solve
de: So löst du es
es: Cómo resolverlo
fr: Comment résoudre
it: Come si risolve
ja: 解き方
ko: 푸는 방법
pt_br: Como resolver
ru: Как решать
zh_hans: 如何求解

source: If a line still needs its %1$@ and has exactly one open square, that square must be the %2$@. Once a line has its %3$@, every other square is empty.
de: Wenn einer Linie noch ihre %@ fehlt und sie genau ein freies Feld hat, muss dieses Feld die %@ sein. Sobald eine Linie ihre %@ hat, ist jedes andere Feld leer.
es: Si a una línea aún le falta su %@ y tiene exactamente una casilla libre, esa casilla debe ser la %@. Una vez que una línea tiene su %@, todas las demás casillas quedan vacías.
fr: Si une ligne attend encore son %@ et n'a qu'une seule case libre, cette case est forcément le %@. Une fois qu'une ligne a son %@, toutes les autres cases sont vides.
it: Se a una linea manca ancora la sua %@ e ha esattamente una casella libera, quella casella deve essere la %@. Una volta che una linea ha la sua %@, ogni altra casella è vuota.
ja: あるラインにまだ%@がなく、空きマスがちょうど1つなら、そのマスが%@です。ラインに%@がそろえば、ほかのマスはすべて空きです。
ko: 한 줄에 아직 %@이(가) 없고 빈칸이 정확히 하나라면, 그 칸이 바로 %@입니다. 한 줄에 %@이(가) 놓이면 나머지 칸은 모두 비어 있습니다.
pt_br: Se uma linha ainda precisa do seu %@ e tem exatamente um quadrado livre, esse quadrado tem de ser o %@. Quando uma linha já tem o seu %@, todos os outros quadrados ficam vazios.
ru: Если в линии ещё нет её %@ и осталась ровно одна свободная клетка, эта клетка и есть %@. Как только в линии появилась её %@, все остальные клетки пусты.
zh_hans: 如果某条线还缺它的%@，而恰好只剩一个空格，那个空格就一定是%@。一旦某条线有了它的%@，其余每一格都为空。

source: If a line still needs its %1$@ and has just one open square, that square is it. Once a line has its %2$@, every other square is a dot.
de: Wenn einer Linie noch ihre %1$@ fehlt und sie nur ein freies Feld hat, ist dieses Feld die Lösung. Sobald eine Linie ihre %2$@ hat, ist jedes andere Feld ein Punkt.
es: Si a una línea aún le falta su %1$@ y solo tiene una casilla libre, esa casilla es la respuesta. Una vez que una línea tiene su %2$@, todas las demás casillas son un punto.
fr: Si une ligne attend encore son %1$@ et n’a qu’une seule case libre, c’est cette case. Une fois qu’une ligne a son %2$@, toutes les autres cases sont un point.
it: Se a una linea manca ancora la sua %1$@ e ha una sola casella libera, è quella la casella giusta. Una volta che una linea ha la sua %2$@, ogni altra casella è un punto.
ja: あるラインにまだ%1$@がなく、空きマスが1つだけなら、そのマスが答えです。ラインに%2$@がそろえば、ほかのマスはすべて点です。
ko: 한 줄에 아직 %1$@이(가) 없고 빈칸이 하나뿐이라면, 바로 그 칸입니다. 한 줄에 %2$@이(가) 놓이면 나머지 칸은 모두 점입니다.
pt_br: Se uma linha ainda precisa do seu %1$@ e tem apenas um quadrado livre, é esse o quadrado. Quando uma linha já tem o seu %2$@, todos os outros quadrados são um ponto.
ru: Если в линии ещё нет её %1$@ и осталась лишь одна свободная клетка — это она и есть. Как только в линии появилась её %2$@, все остальные клетки — точки.
zh_hans: 如果某条线还缺它的%1$@，而只剩一个空格，那就是它了。一旦某条线有了它的%2$@，其余每一格都是点。

source: If a line still needs two %1$@ and has exactly two open squares, both must be %2$@. If a line already has its two, every other square is empty.
de: Wenn eine Linie noch zwei %@ braucht und genau zwei freie Felder hat, müssen beide %@ sein. Hat eine Linie ihre zwei bereits, ist jedes andere Feld leer.
es: Si a una línea le faltan dos %@ y tiene exactamente dos casillas libres, ambas deben ser %@. Si una línea ya tiene sus dos, todas las demás casillas quedan vacías.
fr: Si une ligne a encore besoin de deux %@ et compte exactement deux cases libres, les deux doivent être des %@. Si une ligne a déjà ses deux, toutes les autres cases sont vides.
it: Se a una linea servono ancora due %@ e ha esattamente due caselle libere, entrambe devono essere %@. Se una linea ha già le sue due, ogni altra casella è vuota.
ja: あるラインにまだ2つの%@が必要で、空きマスがちょうど2つなら、その両方が%@になります。すでに2つそろっているラインは、ほかのマスがすべて空きです。
ko: 한 줄에 아직 %@ 두 개가 필요하고 빈칸이 정확히 두 개라면, 둘 다 %@이어야 합니다. 한 줄에 이미 두 개가 있으면 나머지 칸은 모두 비어 있습니다.
pt_br: Se uma linha ainda precisa de dois %@ e tem exatamente dois quadrados livres, ambos devem ser %@. Se uma linha já tem os seus dois, todos os outros quadrados ficam vazios.
ru: Если в линии ещё нужны две %@ и осталось ровно две свободные клетки, обе должны быть %@. Если в линии уже есть две, все остальные клетки пусты.
zh_hans: 如果某条线还需要两个%@，而恰好只剩两个空格，那么这两个都必须是%@。如果某条线已经有了两个，其余每一格都为空。
